Repository: daniel-molina/visualequation
Catalog: locale/*/LC_MESSAGES/visualequation.po
Languages: es

source: Open equation
es: Abrir ecuación

source: Valid formats (*.png *.pdf)
es: Formatos válidos (*.png *.pdf)

source: No equation inside this file.
es: No hay ninguna ecuación dentro de este archivo.

source: Error parsing metadata. ValueError: %s Was the file created with your version of Visual Equation?
es: Error mientras se analizaban los metadatos. Código de error: %s ¿El archivo ha sido creado con tu versión de Visual Equation?

source: Select format: Note: Equations can only be recovered from PNG and PDF.
es: Selecciona formato: Nota: Las ecuaciones solo pueden ser recuperadas desde PNG y PDF.

source: Size (dpi):
es: Tamaño (dpi):

source: Size (scale):
es: Tamaño (escala):

source: A file named "%s" already exists. Do you want to replace it?
es: Ya existe un archivo llamado "%s". ¿Deseas reemplazarlo?

source: Overwrite
es: Sobrescribir

source: Copy to Clipboard
es: Copiar al Portapapeles

source: Tip: If you pretend to copy the code, do not close the program before pasting.
es: Consejo: Si pretendes copiar el código, no cierres el programa antes de pegarlo.

source: Only selection
es: Solo la selección

source: Full code
es: Código completo

source: Edit LaTeX code
es: Editar código LaTeX

source: Check LaTeX code (Ctrl+Return)
es: Comprobar código LaTeX (Ctrl+Enter)

source: Change LaTeX code as desired
es: Cambia el código LaTeX a tu gusto

source: Note: It will not be possible to select individual elements of this block if it is edited.
es: Nota: No será posible seleccionar elementos individuales de este bloque si es editado.

source: Press Check button when code is ready
es: Presiona el botón Comprobar cuando el código esté listo

source: LaTeX code contains invalid characters
es: El código LaTeX contiene caracteres inválidos

source: Checking LaTeX code...
es: Comprobando código LaTeX...

source: LaTex code is not valid
es: El código LaTeX no es válido

source: LaTex code is valid
es: El código LaTeX es válido

source: &New
es: &Nuevo

source: Create a new equation
es: Crear una nueva ecuación

source: &Open
es: &Abrir

source: Open equation from image
es: Abrir ecuación a partir de una imagen

source: &Save
es: &Guardar

source: Save image
es: Guardar imagen

source: &Exit
es: &Salir

source: Exit application
es: Cerrar programa

source: &Undo
es: &Deshacer

source: Return equation to previous state
es: Devuelve ecuación al estado anterior

source: &Redo
es: &Rehacer

source: Recover next equation state
es: Recupera el siguiente estado de la ecuación

source: &Copy
es: &Copiar

source: Copy selection
es: Copiar selección

source: C&ut
es: Cor&tar

source: Cut selection
es: Cortar selección

source: &Paste
es: &Pegar

source: Paste previous cut or copied selection
es: Pegar selección anteriormente cortada o copiada

source: Edit &LaTeX
es: Editar &LaTeX

source: Edit LaTeX code of selected block
es: Editar código LaTeX del bloque seleccionado

source: Select the entire equation
es: Selecciona toda la ecuación

source: Equation will no be increased.
es: No se incrementará más la ecuación.

source: Zoom &In
es: Ampliar

source: Increase size of the equation
es: Incrementar tamaño de la ecuación.

source: Equation will no be decreased.
es: La ecuación no decrecerá más.

source: Zoom &Out
es: Reducir

source: Decrease size of the equation
es: Disminuir tamaño de la ecuación

source: Show &LaTeX code
es: Mostrar código &LaTeX

source: Show the LaTeX code generating the equation
es: Mostrar el código LaTeX que genera la ecuación

source: Invite &Alice
es: Invita a &Alicia

source: Let Alice to be with you while building the equation
es: Deja que Alicia te acompañe mientras creas la ecuación

source: Basic &usage
es: &Uso básico

source: Basic usage of the program
es: Uso básico del programa

source: About &Visual Equation
es: Acerca de &Visual Equation

source: About &Qt
es: Acerca de &Qt

source: &File
es: &Archivo

source: &Edit
es: &Editar

source: &View
es: &Ver

source: &Games
es: &Juegos

source: &Help
es: A&yuda

source: <p>Visual Equation is expected to be user-friendly and intuitive, so it should not be difficult to use if you understand its usage. Basically:</p><p>Instead of a cursor, you navigate with a "ghost" that surrounds blocks of the equation, from single symbols to arguments, operators and the entire equation. Change the ghost's selection and insert characters at the direction in which the ghost is facing by pressing keys on the keyboard or clicking symbols in the bottom panel. If the ghost surrounds a square, as when you open the program, you overwrite the square.</p><p>These are the main keys:</p><ul><li><b>LEFT</b>: Change the direction of the ghost to the left or navigate backwards.</li><li><b>RIGHT</b> or <b>TAB</b>: Change the direction of the ghost to the right or navigate forwards.</li><li><b>UP</b> and <b>DOWN</b>: Put a superindex or subindex in the direction pointed by the ghost.</li><li><b>DELETE</b> or <b>BACKSPACE</b>: Remove current selection. If it was the entire argument of an operator, a square will remain so you can change it by something else.</li><li><b>Left-click</b> on an element of the symbols panel: Insert the element where the ghost is facing.</li><li><b>SHIFT + Left-click</b> on an element of the symbols panel (<b>VERY handy</b>): If the element is an operator, the selection is replaced by the operator and its first argument is set to previous selection. (The first argument is the one represented by dots) If the element is a symbol, the selection is replaced by the symbol.</li></ul><p>You may learn also the short-cuts noted in the menu.</p>
es: <p>Visual Equation debería ser amigable para el usuario e intuitivo, por lo que no debería resultar difícil de usar si comprendes su uso. Básicamente:</p><p>En lugar de un cursor, se navega con un "fantasma" que rodea bloques de la ecuación, desde símbolos hasta argumentos, operadores y toda la ecuación. Cambia la selección del fantasma e inserta caracteres en la dirección en que el fantasma mira presionando teclas del teclado haciendo click en el panel de abajo. Si el fantasma rodea un cuadrado, como cuando abres el programa, se sobrescribe encima del cuadrado.</p><p>Estas son las principales teclas:</p><ul><li><b>IZQUIERDA</b>: Cambia la dirección del fantasma hacia la izquierda o navega hacia atrás.</li><li><b>DERECHA</b> o <b>TABULADOR</b>: Cambia la dirección del fantasma hacia la derecha o navega hacia adelante.</li><li><b>ARRIBA</b> y <b>ABAJO</b>: Pon un superíndice o subíndice en la dirección que apunta el fantasma.</li><li><b>SUPRIMIR</b> o <b>BORRAR</b>: Elimina la selección actual. Si era un argumento completo de un operador, quedará un cuadrado que podrás cambiar por alguna otra cosa.</li><li><b>Click Izquierdo</b> en un elemento del panel de símbolos: Inserta el elemento donde el fantasma está mirando.</li><li><b>SHIFT + Click Izquierdo</b> en un elemento del panel de símbolos (<b>MUY útil</b>): Si el elemento es un operador, la selección se reemplaza por el operador y su primer argumento será lo anteriormente seleccionado (El primer argumento es el que está representado por puntos). Si el elemento es un símbolo, la selección es reemplazada por el símbolo.</li></ul><p>También puedes aprender los atajos de teclado señalados en el menú.</p>

source: Basic usage
es: Uso básico

source: <p>Visual Equation</p><p><em>Version:</em> %s </p><p><em>Author:</em> Daniel Molina Garcia</P><p><em>Sources:</em> <a href="https://github.com/daniel-molina/visualequation">Webpage</a></p><p><em>License:</em> GPLv3 or above</p>
es: <p>Visual Equation</p><p><em>Versión:</em> %s </p><p><em>Autor:</em> Daniel Molina García</P><p><em>Código fuente:</em> <a href="https://github.com/daniel-molina/visualequation">Página web</a></p><p><em>Licencia:</em> GPLv3 o superior</p>

source: About
es: Acerca de

source: Create equations visually.
es: Crea ecuaciones visualmente.

source: Free delimiters
es: Delimitadores libres

source: Left delimiter:
es: Delimitador izquierdo:

source: Choose
es: Elegir

source: Right delimiter:
es: Delimitador derecho:

source: Left delimiter
es: Delimitador izquierdo

source: Right delimiter
es: Delimitador derecho

source: Choose arguments
es: Elige argumentos

source: Argument over operator
es: Argumento sobre el operador

source: Argument under operator
es: Argumento bajo el operador

source: Note: It is also possible to put arguments in the corners by surrounding the operator and using keys UP and DOWN.
es: Nota: También es posible poner argumentos en las esquinas al seleccionar el operador y usar las teclas ARRIBA y ABAJO.

source: Matrix
es: Matriz

source: Number of rows:
es: Número de filas:

source: Number of columns:
es: Número de columnas:

source: Matrix type:
es: Tipo de matriz:

source: Matrix type
es: Tipo de matriz

source: General Array
es: Matriz genérica

source: Alignment of columns (e.g. lc|r): (l: left, c: center, r: right, |: v. line)
es: Alineamiento de las columnas (ejemplo: lc|r): (l: a la izquierda, c: centrado, r: a la derecha, |: línea v.)

source: Cases
es: Casos

source: Number of cases:
es: Número de casos:

source: Equation system
es: Sistema de ecuaciones

source: Number of equations:
es: Número de ecuaciones:

source: Aligned environment
es: Entorno alineado

source: Number of lines:
es: Número de líneas:

source: Text
es: Texto

source: Text:
es: Texto:

source: %s characters
es: Caracteres %s

source: Choose color
es: Elige el color

source: Caligraphic (only capital letters)
es: Caligráfica (solo letras mayúsculas)

source: Mathbb (only capital letters)
es: Mathbb (solo letras mayúsculas)

source: Fraktur (letters and numbers)
es: Fraktur (letras y números)

source: Sans serif (letters and numbers)
es: Sans serif (letras y números)

source: Bold (letters and numbers)
es: Negrita (letras y números)

source: Bold Italic (letters and numbers)
es: Negrita Itálica (letras y números)

source: Variable-size operator
es: Operador de tamaño variable

source: Limit over the sign
es: Límite sobre el signo

source: Limit under the sign
es: Límite bajo el signo

source: Note: It is also possible to put arguments in the corners of the operator by surrounding the operator and using keys UP and DOWN.
es: Nota: También es posible poner argumentos en las esquinas del operador seleccionado dicho operador y usando las teclas ARRIBA y ABAJO.

source: Integral operator
es: Operador integral

source: Argument over the integral sign
es: Argumento sobre el signo integral

source: Argument under the integral sign
es: Argumento bajo el signo integral

source: Note: Leaving boxes unchecked will allow to put the limits in the corners of the integral by surrounding the integral and using keys UP and DOWN.
es: Nota: Dejar las casillas sin marcar permitirá poner los límites en las esquinas de la integral al seleccionar dicha integral y usar las teclas ARRIBA y ABAJO.
